# Import Libraries and Read data

In [1]:
import pandas as pd 
import numpy as np

In [32]:
dic_data = {'string_col':['1','2','3','4'],
            'int_float_D':[1,2,3.2,4.6],
            'int_float_r':[1,2,3.2,4.6],
            'mix_col':['a','-2',3,4],
            'missing':[1,2,3,np.nan],
            'money':['$1.500.00','$3.436.45','$958.99','$1.198.00']
           }

In [33]:
df = pd.DataFrame.from_dict(dic_data)

In [34]:
df

  string_col  int_float_D  int_float_r mix_col  missing      money
0          1          1.0          1.0       a      1.0  $1.500.00
1          2          2.0          2.0      -2      2.0  $3.436.45
2          3          3.2          3.2       3      3.0    $958.99
3          4          4.6          4.6       4      NaN  $1.198.00

![separator2](https://i.imgur.com/4gX5WFr.png)

# Analysis Data Types of columns

In [35]:
df.dtypes

string_col      object
int_float_D    float64
int_float_r    float64
mix_col         object
missing        float64
money           object
dtype: object

## string_col
```it consists of numbers but its data type is object so let's convert its data type to int```

In [36]:
df['string_col'] = df['string_col'].astype(int)

In [37]:
df['string_col'].dtype

dtype('int32')

## int_float_D
```convert this column to int with Round down```

In [38]:
df['int_float_D'] = df['int_float_D'].astype(int)

In [39]:
df['int_float_D'].dtype

dtype('int32')

In [40]:
df['int_float_D']

0    1
1    2
2    3
3    4
Name: int_float_D, dtype: int32

## int_float_r
```convert this column to int with Round using number of decimal points```

In [41]:
df['int_float_r'] = df['int_float_r'].round(0).astype(int)

In [42]:
df['int_float_r'].dtype

dtype('int32')

In [43]:
df['int_float_r']

0    1
1    2
2    3
3    5
Name: int_float_r, dtype: int32

In [44]:
df.dtypes

string_col       int32
int_float_D      int32
int_float_r      int32
mix_col         object
missing        float64
money           object
dtype: object

In [45]:
df.head()

   string_col  int_float_D  int_float_r mix_col  missing      money
0           1            1            1       a      1.0  $1.500.00
1           2            2            2      -2      2.0  $3.436.45
2           3            3            3       3      3.0    $958.99
3           4            4            5       4      NaN  $1.198.00

## mix_col
```its data type is object and i want to convert it to number but it contains string so use numeric on this col first```